Revit 2027 API
ParameterFilterElement.AllRuleParametersApplicable Method
Overload List
Name | Description
AllRuleParametersApplicable(ElementFilter) |  Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
AllRuleParametersApplicable(Document, ICollection<ElementId>, ElementFilter) |  Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories.
Top
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace